{
    "starters": [
        {
            "id": "str01",
            "name": "Chicken Cesar Salad with Honey Pecan Nuts",
            "description": "The recipe Green Asparagus Chicken Cesar Salad with Honey Pecan Nuts can be made in approximately 1 hour. This recipe serves 4 and costs $3.28 per serving. One serving contains 770 calories, 29g of protein, and 64g of fat. One serving covers 4% of your daily needs of vitamins and minerals, this recipe can therefore be considered not so healthy. It works well as a rather expensive salad for Easter. A mixture of olive oil, thyme, olive oil, and a handful of other ingredients are all it takes to make this recipe so delicious. It is brought to you by What's for Lunch Honey. 1 person found this recipe to be tasty and satisfying.",
            "image": "images/157548-556x370.jpg",
            "price": 8.50,
            "allergens": [
                "all5",
                "all7",
                "all8"
            ]
        },
        {
            "id": "str02",
            "name": "Salmon Carpaccio with Wasabi",
            "description": "This recipe makes 6 servings with 139 calories, 9g of protein, and 11g of fat each. For $1.18 per serving, this recipe covers 8% of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 1 would say it hit the spot. Head to the store and pick up garnishes: pickled ginger, won ton crisps, i also have: milk eggs cheese, and a few other things to make it today. It is brought to you by My Recipes. All things considered, we decided this recipe deserves a spoonacular score of 66%. This score is pretty good.",
            "image": "images/87207-556x370.jpg",
            "price": 9.95,
            "allergens": [
                "all1",
                "all4"
            ]
        },
        {
            "id": "str03",
            "name": "Mushroom Risotto",
            "description": " One serving contains 349 calories, 12g of protein, and 8g of fat. This pescatarian and gluten free recipe serves 4 and costs $3.48 per serving. One serving covers 4% of your daily needs of vitamins and minerals, this recipe can therefore be considered unhealthy. Plenty of people made this recipe, and 98086 would say it hit the spot. This recipe from www.closetcooking.com requires truffle oil, mushrooms, , and dried porcini mushrooms. To use up the garlic you could follow this main course with the Caramelized Garlic Tart as a dessert. This recipe is typical of Mediterranean cuisine. From preparation to the plate, this recipe takes roughly 45 minutes.",
            "image": "images/248345-556x370.jpg",
            "price": 8,
            "allergens": [
            ]
        },
        {
            "id": "str04",
            "name": "Pumpkin Soup",
            "description": "For $1.89 per serving, this recipe covers 3% of your daily requirements of vitamins and minerals. This recipe serves 4. One serving contains 197 calories, 3g of protein, and 8g of fat. This recipe is not so healthy. Our tips section below might have some information that could improve the score. This recipe from veggienumnum.com requires brown onion, pumpkin, rice milk, and cayenne pepper. 5 people were impressed by this recipe. It will be a hit at your Winter event. From preparation to the plate, this recipe takes approximately 22 minutes.",
            "image": "images/24120-556x370.jpg",
            "price": 7.50,
            "allergens": [
                "all1",
                "all5",
                "all7"
            ]
        },
        {
            "id": "str05",
            "name": "Spaghetti Fra Diavolo",
            "description": "The recipe Simple Spaghetti Fra Diavolo can be made in about 45 minutes. One serving contains 577 calories, 10g of protein, and 38g of fat. For $1.39 per serving, this recipe covers 41% of your daily requirements of vitamins and minerals. This recipe is very healthy. Our tips section below might have some information that could raise the score. This recipe serves 4. This recipe from bakerbynature.com requires red pepper flakes, spaghetti, , and . Plenty of people made this recipe, and 127551 would say it hit the spot. It is a good option if you're following a gluten free and vegan diet. Taking all factors into account, this recipe earns a spoonacular score of 99%, which is super.",
            "image": "images/667024-556x370.jpg",
            "price": 7.25,
            "allergens": [
            ]
        },
        {
            "id": "str06",
            "name": "Mussels and Clams with Spicy Tomato Broth",
            "description": "Mussels and Clams with Spicy Tomato Broth is a dairy free and pescatarian recipe with 5 servings. For $2.92 per serving, this recipe covers 85% of your daily requirements of vitamins and minerals. One serving contains 3151 calories, 132g of protein, and 202g of fat. Head to the store and pick up pepper, canned tomatoes, serrano chile, and a few other things to make it today. To use up the dry white wine you could follow this main course with the Coconut Orange Chardonnay Cupcakes as a dessert. 348 people were impressed by this recipe. Several people really liked this main course. From preparation to the plate, this recipe takes roughly 55 minutes. Taking all factors into account, this recipe earns a spoonacular score of 97%, which is outstanding.",
            "image": "images/753182-556x370.jpg",
            "price": 10,
            "allergens": [
                "all2",
                "all6"
            ]
        },
        {
            "id": "str07",
            "name": "Rösti with Fried Eggs",
            "description": "This recipe serves 4. If you're trying to eat healthier, be aware that this recipe covers 5% of your daily needs of vitamins and minerals and is considered not so healthy. One portion of this dish contains around 18g of protein, 31g of fat, and a total of 465 calories. This recipe is liked by 1 foodies and cooks. It works best as a main course, and is done in roughly 45 minutes. This recipe from Epicurious requires eggs, russet potatoes, butter, and black pepper. To use up the gruyere cheese you could follow this main course with the Gardener's Pie as a dessert. It costs $1.67 per serving.",
            "image": "images/156016-556x370.jpg",
            "price": 8.95,
            "allergens": [
                "all3"
            ]
        },
        {
            "id": "str08",
            "name": "Creamed Spinach",
            "description": "Creamed Spinach is a vegetarian recipe with 4 servings. One serving covers 6% of your daily needs of vitamins and minerals, this recipe can therefore be considered not so healthy. One portion of this dish contains about 7g of protein, 9g of fat, and a total of 142 calories. This recipe from Jo Cooks has 725 fans. From preparation to the plate, this recipe takes about 35 minutes. If you have garlic, onion, , and a few other ingredients on hand, you can make it. It costs $1.78 per serving-- we find this rather inexpensive. It works well as a side dish.",
            "image": "images/559249-556x370.jpg",
            "price": 8,
            "allergens": [
                "all5"
            ]
        }
    ],
    "mainCourses": [
        {
            "id": "main01",
            "name": "BBQ Bourbon Ribs",
            "description": "BBQ Bourbon Ribs could be a super recipe to try. One serving contains 222 calories, 18g of protein, and 11g of fat. This recipe serves 15. For 81 cents per serving, this recipe covers 11% of your daily requirements of vitamins and minerals. Not a lot of people really liked this American dish. If you have pepper, orange juice, paprika, and a few other ingredients on hand, you can make it. To use up the bourbon you could follow this main course with the Bourbon Pecan Fudge Brownies as a dessert. This recipe is liked by 1 foodies and cooks. It is brought to you by Kraftrecipes.com. From preparation to the plate, this recipe takes about 1 hour and 15 minutes. Taking all factors into account, this recipe earns a spoonacular score of 67%, which is pretty good.",
            "image": "images/269263-556x370.jpg",
            "price": 12.10,
            "allergens": [
            ]
        },
        {
            "id": "main02",
            "name": "Sweet and Spicy Chicken Wings",
            "description": "Sweet and Spicy Chicken Wings is a gluten free and dairy free recipe with 4 servings. If you're trying to eat healthier, be aware that this recipe covers 18% of your daily needs of vitamins and minerals and is considered nutritionally empty. This hor d'oeuvre has 640 calories, 45g of protein, and 39g of fat per serving. Head to the store and pick up balsamic vinegar, chicken wings, chili pepper sauce, and a few other things to make it today. To use up the balsamic vinegar you could follow this main course with the Strawberry Tart as a dessert. 103018 people found this recipe to be scrumptious and satisfying. Costing $1.88 per serving, this recipe is rather cheap. From preparation to the plate, this recipe takes approximately 0 minutes. It is brought to you by She Wears Many Hats. Taking all factors into account, this recipe earns a spoonacular score of 79%, which is good.",
            "image": "images/711589-556x370.jpg",
            "price": 10,
            "allergens": [
                "all1"
            ]
        },
        {
            "id": "main03",
            "name": "Lemon Chicken Tarragon",
            "description": "Lemon Chicken Tarragon takes around 21 minutes from beginning to end. This recipe covers 5% of your daily requirements of vitamins and minerals. We would call that a not so healthy main course. This recipe makes 4 servings with 588 calories, 33g of protein, and 11g of fat each. This recipe is liked by 1 foodies and cooks. Costing $1.75 per serving, this recipe is affordable. A mixture of condensed cream of chicken soup, chicken breast, white rice, and a handful of other ingredients are all it takes to make this recipe so delicious. To use up the water you could follow this main course with the Hot Water Pavlova as a dessert.",
            "image": "images/46742-556x370.jpg",
            "price": 9.90,
            "allergens": [
            ]
        },
        {
            "id": "main04",
            "name": "Turkey Enchiladas",
            "description": "Turkey Enchiladas takes around roughly 45 minutes from beginning to end. One portion of this dish contains approximately 46g of protein, 30g of fat, and a total of 585 calories. This recipe is awesome healthy. Our tips section below might have some information that could increase the score. For $1.79 per serving, this recipe covers 68% of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe is liked by 1 foodies and cooks. Not a lot of people really liked this Mexican dish. A mixture of Qchilli seedsE, Qcorn tortillasE, Qred pepperE, and a handful of other ingredients are all it takes to make this recipe so delicious. To use up the cheese you could follow this main course with the Cheese Cakes as a dessert. It works well as a rather inexpensive main course. It is brought to you by Foodista. It is a good option if you're following a gluten free diet. All things considered, we decided this recipe deserves a spoonacular score of 87%.",
            "image": "images/664030-556x370.jpg",
            "price": 11,
            "allergens": [
                "all7"
            ]
        },
        {
            "id": "main05",
            "name": "English-Style Fish and Chips",
            "description": "This pescatarian and dairy free recipe serves 4 and costs $3.23 per serving. If you're trying to eat healthier, be aware that this recipe covers 4% of your daily needs of vitamins and minerals and is considered unhealthy. One serving contains 539 calories, 39g of protein, and 3g of fat. This recipe from A Family Feast has 7551 fans. Head to the store and pick up black pepper, cod, malt vinegar, and a few other things to make it today. To use up the lemon-lime soda you could follow this main course with the Kid Friendly Sangria Fruit Pops as a dessert. From preparation to the plate, this recipe takes about 30 minutes.",
            "image": "images/595258-556x370.jpg",
            "price": 12.5,
            "allergens": [
                "all4"
            ]
        },
        {
            "id": "main06",
            "name": "Classic Hamburger",
            "description": "One serving covers 6% of your daily needs of vitamins and minerals, this recipe can therefore be considered not so healthy. One serving contains 416 calories, 50g of protein, and 20g of fat. This recipe is liked by 10 foodies and cooks. Head to the store and pick up butter, ground top sirloin, salt and pepper, and a few other things to make it today. To use up the bread crumbs you could follow this main course with the Ruby Blackburn Lambert's Persimmon Pudding as a dessert. It is a rather pricey recipe for fans of American food. From preparation to the plate, this recipe takes about 25 minutes. It is brought to you by Copy Kat. It is a good option if you're following a gluten free diet.",
            "image": "images/601364-556x370.jpg",
            "price": 12.8,
            "allergens": [
                "all7"
            ]
        },
        {
            "id": "main07",
            "name": "Duck with Cranberry Mostaza",
            "description": "Duck with Cranberry Mostaza might be a good recipe to expand your main course repertoire. This recipe makes 4 servings with 467 calories, 34g of protein, and 11g of fat each. For $6.49 per serving, this recipe covers 25% of your daily requirements of vitamins and minerals. Head to the store and pick up wine, cranberries, vegetable oil, and a few other things to make it today. To use up the sugar you could follow this main course with the Whole Wheat Refined Sugar Free Sugar Cookies as a dessert. 1 person found this recipe to be delicious and satisfying. It is a good option if you're following a gluten free and dairy free diet. It is brought to you by Food and Wine. All things considered, we decided this recipe deserves a spoonacular score of 67%. This score is solid.",
            "image": "images/14452-556x370.jpg",
            "price": 15,
            "allergens": [
            ]
        },
        {
            "id": "main08",
            "name": "Southwestern Steak & Peppers",
            "description": "Southwestern Steak & Peppers is a gluten free and dairy free main course. This recipe serves 4 and costs $2.66 per serving. One portion of this dish contains about 27g of protein, 7g of fat, and a total of 229 calories. Plenty of people made this recipe, and 512 would say it hit the spot. From preparation to the plate, this recipe takes approximately 35 minutes. It is perfect for valentin day. This recipe from Eating Well requires balsamic vinegar, top sirloin steak, chili powder, and salt. To use up the brown sugar you could follow this main course with the Brown-sugar Pound Cupcakes With Brown-butter Glaze as a dessert. Taking all factors into account, this recipe earns a spoonacular score of 100%, which is outstanding.",
            "image": "images/697258-556x370.jpg",
            "price": 14,
            "allergens": [
            ]
        }
    ],
    "desserts": [
        {
            "id": "des01",
            "name": "Strawberry Cheesecake",
            "description": "Strawberry Cheesecake is a dessert that serves 12. This recipe is not so healthy since one serving covers 3% of your daily needs of vitamins and minerals. One serving contains 506 calories, 7g of protein, and 31g of fat. This recipe from Epicurious requires sugar, cream cheese, red currant jelly, and butter. It costs $2.27 per serving-- we find this rather cheap. 24 people were impressed by this recipe. It is a good option if you're following a vegetarian diet. From preparation to the plate, this recipe takes about 13 hours and 31 minutes.",
            "image": "images/Tarta-de-queso-5.jpg",
            "price": 6.50,
            "allergens": [
                "all5",
                "all7"
            ]
        },
        {
            "id": "des02",
            "name": "Pistachio Cupcake",
            "description": "Pistachio Cupcakes could be an amazing recipe to try. This recipe makes 24 servings with 46 calories, 0g of protein, and 3g of fat each. This recipe is not the least bit healthy. Our tips section below might have some information that could improve the score. For 9 cents per serving, this recipe covers 1% of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes around around 45 minutes. This recipe from She Wears Many Hats requires pistachio pudding mix, batch of vanilla buttercream frosting, weight white chocolate chips, and vegetable oil. 515 people found this recipe to be yummy and satisfying. Many people really liked this American dish.",
            "image": "images/537363-556x370.jpg",
            "price": 5,
            "allergens": [
                "all3",
                "all5"
            ]
        },
        {
            "id": "des03",
            "name": "Black and White Cookie Ice Cream Sandwiches",
            "description": "Black and White Cookie Ice Cream Sandwiches might be a recipe you should try. For 50 cents per serving, you get a dessert that serves 20. If you're trying to eat healthier, be aware that this recipe covers 2% of your daily needs of vitamins and minerals and is considered not at all healthy. One serving contains 301 calories, 4g of protein, and 10g of fat. It can be enjoyed any time, but it is especially good for Summer. Head to the store and pick up lemon juice, powdered sugar, vanilla bean ice cream, and a few other things to make it today. 3393 people found this recipe to be flavorful and satisfying. It is brought to you by How Sweet Eats. From preparation to the plate, this recipe takes roughly 4 hours.",
            "image": "images/525473-556x370.jpg",
            "price": 6,
            "allergens": [
                "all5",
                "all7"
            ]
        },
        {
            "id": "des04",
            "name": "Chocolate Bread Pudding",
            "description": "Chocolate Bread Pudding requires approximately 45 minutes from start to finish. This recipe is not so healthy. Our tips section below might have some information that could raise the score. This recipe serves 8. For 94 cents per serving, this recipe covers 5% of your daily requirements of vitamins and minerals. One portion of this dish contains about 8g of protein, 29g of fat, and a total of 452 calories. This recipe is liked by 13 foodies and cooks. It is a very reasonably priced recipe for fans of Southern food. It is brought to you by Epicurious. If you have butter, whipping cream, french bread, and a few other ingredients on hand, you can make it. It is a good option if you're following a vegetarian and gluten free diet.",
            "image": "images/140579-556x370.jpg",
            "price": 7.4,
            "allergens": [
                "all5",
                "all7"
            ]
        },
        {
            "id": "des05",
            "name": "Apple-Cranberry Pie",
            "description": "Apple-Cranberry Pie requires around 1 hour and 15 minutes from start to finish. One serving contains 166 calories, 2g of protein, and 8g of fat. This recipe serves 15. For 50 cents per serving, this recipe covers 2% of your daily requirements of vitamins and minerals. It is a good option if you're following a vegetarian diet. This recipe is liked by 1 foodies and cooks. This recipe from Kraftrecipes.com requires philadelphia cream cheese, vanilla, sugar, and ready-to-use pie crust. Overall, this recipe earns a not so outstanding spoonacular score of 11%.",
            "image": "images/267770-556x370.jpg",
            "price": 7.1,
            "allergens": [
                "all3",
                "all5"
            ]
        }
    ],
    "allergens": [
        {
            "id": "all1",
            "name": "celery",
            "foundIn": "salads, soups, stock cubes, celery salt, celery powder, celeriac powder",
            "icon": "icons/celery_icon.png"
        },
        {
            "id": "all2",
            "name": "crustaceans",
            "foundIn": "shrimp paste, thai curry pastes, salads",
            "icon": "icons/crustaceans_icon.png"
        },
        {
            "id": "all3",
            "name": "eggs",
            "foundIn": "cakes, mousses, sauces, pasta, quiche, mayonnaise, meat products",
            "icon": "icons/eggs_icon.png"
        },
        {
            "id": "all4",
            "name": "fish",
            "foundIn": "salad dressings, pizza, relishes, fish sauce, stock cubes",
            "icon": "icons/fish_icon.png"
        },
        {
            "id": "all5",
            "name": "milk",
            "foundIn": "foods glazed with milk, whey, lactose, ghee",
            "icon": "icons/milk_icon.png"
        },
        {
            "id": "all6",
            "name": "molluscs",
            "foundIn": "oyster sauce and an ingredient of fish stews",
            "icon": "icons/molluscs_icon.png"
        },
        {
            "id": "all7",
            "name": "cereals",
            "foundIn": "foods containing flour, bread, pasta, cakes, pastry, meat products, sauces, soups, batter etc wheat based glucose syrups, also cereals used in distillates for spirits.",
            "icon": "icons/cereals_containing_gluten_icon.png"
        },
        {
            "id": "all8",
            "name": "peanuts",
            "foundIn": "sauces, cakes, desserts, groundnut oil, peanut flour, peanut butter, satay sauce.",
            "icon": "icons/peanuts_icon.png"
        }
    ]
}